// Рендеринг игровых карт, который содержит:
//
//     карты номиналом 2-10 всех мастей
// карты валет, дама, король всех мастей
// карты тузов всех мастей
//
//
// В модели используются:
//
//     Семейство шрифтов https://fonts.google.com/specimen/Nerko+One
//     Зеленый цвет стола #55aa55
// Черный цвет текста #353c4d
// Иконки для 4 полосок и валета, дамы, короля в архиве images.zip
//
//
// Все теги должны отображаться с помощью js.
//
//     Внешний вид задачи НЕ важен, важен только JS-код))